[
  {
    "path": "posts/2022-08-02-posits-conf-time/",
    "title": "POS...IT's conf() time 🥁",
    "description": "Pause, it's time to write about RStudio conf(2022).",
    "author": [
      {
        "name": "Maitreyee Sidhaye",
        "url": {}
      },
      {
        "name": "Chloe Pou-Prom",
        "url": {
          "https://twitter.com/chloepouprom": {}
        }
      }
    ],
    "date": "2022-08-02",
    "categories": [
      "post-miscellaneous"
    ],
    "contents": "\n\nContents\n2 years before\n2 weeks before\nDuring\nDo not skip the keynotes!\nFocus on the content of the talk\nGet social!\nHex stickers!\n\n2 days after\n2 months after…?\n\n2 years before\nPicture this. It’s January 2020, you’re in Toronto, it’s the middle of winter, you’re just back from vacation… and you’re suffering from FOMO1 because your teammates are in sunny San Francisco collecting hex stickers, taking selfies with Hadley, and having the time of their lives at rstudio::conf(2020).\nWe were jealous.\nFast-forward… and now WE are the ones living the dream! ✨\n\n\n\nFigure 1: Peep the cool background wall!\n\n\n\n2 weeks before\nThis was the first time for both of us and we wanted to be ready. Here’s how you can do it too!\nDownload the RStudio conf app and bookmark all the talks that interest you. We asked our teammates which topics would be most relevant for the team. We ended up with the following: data science for healthcare, working with Quarto, working with Python, putting things in deployment/production, enhancements to tidymodels, best practices, MLOps/DevOps, training/teaching.\nWatch old talks. These can all be found here.2\nReach out to people who will be attending. The motto for this year’s conference was “It’s always better when we’re together”. Keeping that in mind, we reached out to our awesome RStudio customer success rep and to friends we had met through the RStudio Community Meetup. It was great to see them in-person!\nMake a list of places you want to visit. We prepared our sight-seeing and food map.\nDuring\nDo not skip the keynotes!\nWe got to experience our very own Oprah moment during the first keynote when the Posit announcement was made. Below is a sensationalized retelling of what happened during the very first talk.\n\n\nHADLEY, shortly after making the Posit rebranding announcement: “Now some of you may be wondering… where are our new stickers?”\nHADLEY pauses and surveys the crowd with a mischievous look.\nHADLEY: Now, if you all take a look under your seat…\nIntense shuffling sounds can be heard as THE AUDIENCE begins to search under their seat. People gasp and laugh as they pull envelopes from under their seat. MAITREYEE and CHLOE take their envelopes and find two stickers!\n[TODO: INSERT PHOTO OF STICKERS]\n[LATER IN THE EVENING…]\n\n\nIn the interest of avoiding widespread panic we’re not moving away from hexagons for package stickers. posit isn’t a package so it gets a different shape #rstudioconf\n\n— Hadley Wickham (@hadleywickham) July 27, 2022\n\n\n\nFocus on the content of the talk\nAll the talks were excellent. The conference put in support for speech coaching and it paid off. All the talks were engaging. The talks were framed as stories. The material was easy-to-digest.\nAll material will be available online.\nGet social!\nThere are plenty of opportunities for socializing and networking.\nGroups of interest: - r-ladies\n\n\nHello from #RLadies at #RStudioConf!! 👋#RStudioConf2022 pic.twitter.com/G9gqxpdnw7\n\n— R-Ladies Global (@RLadiesGlobal) July 29, 2022\n\nLATAM speakers\nbirds of a feather groups! healthcare!!\nRStudio is committed to keeping their events inclusive and welcoming, which is highlighted by the Pac-man concept. Throughout the conference, we felt that. - pronoun pins\nmasks mandatory\nCOVID pins\ndiversity scholarship\nTake down key points, but you don’t need to write down everything. Materials are available. If not, most speakers are on Twitter and are happy to answer.\nGRAB DESSERT BEFORE LUNCH!!! The dessert table is the first to run out.\nHex stickers!\nGrab t-shirts and hex stickers for your teammates.\nDrop by the rLadies event and grab more hex stickers and a COOL CARD DECK\n2 days after\nThe three post-conference Rs: Reflect think react (w)Rite talk present share Release\nReflect: Think about talks that stood out to you.\nWe both liked: Quarto!! [link to material] And it seems like the community is keen too, because there is already an Awesome List for Quarto!\nMaitreyee’s favorite talks:\nhighlights of the knitr package\n3D\nshiny without a server\ntidyclust\nChloe’s favorite talks:\nDesigning a Socially Critical Data Science Course by Brian Danielak\nHow Anchorage Built Alaska’s Vaccine Finder with R by Ben Matheson detailed the amazing work that the Anchorage Innovation Team did to develop and deploy a mobile vaccine finder. During the talk, Ben highlighted the importance of building and rolling out a MVP (minimum viable product).\nWhat they forgot to teach you about industry transitions from academia (WTF AITA) by Travis Gerke offered some great advice on poeple searching for jobs. While this talk focused on those transitioning from academia to industry, the materials presented will be useful to many! Check out the cool website!\nA Journey to Data Science: Tools for Equity and Diversity in STEM by Ileana Fenwick\nw(R)ite: write a blog post! (this!!)\nRelease: sharing the extra Shirts and stickers! How can we take our findings and apply them…\n2 months after…?\nWe hope to achieve the following:\nIntegrate Quarto into our workflows. We hope to move this blog to Quarto. This tutorial will be a great starting point.\n**Try Python for Shiny. Our team has a mix of R and Python developers, some who have used Shiny and some who have not.\nCreate consistent templates and color schemes for organization. Branding is important!\nOnboarding - give agency to newcomers. This came up during a few talks. Let the newcomers make changes to your company guide (here at DSAA, we have the DSAA handbook that is used for onboarding purposes).\nShare learning materials. From Jeff Leek’s closing keynote: “Mentorship is a debt you don’t pay off, you pay it forward”. We want to share some of the cool work we do and resources/tutorials, what it’s like working as a data scientist in healthcare. This blog is a step towards that.\nCreate our own hex sticker!\n\nFOMO = fear of missing out↩︎\nSome of our favorites: “Object of type ‘closure’ is not subsettable” by Jenny Bryan, “Open Source Software for Data Science” by JJ Allaire, “Deploying End-To-End Data Science with Shiny, Plumber, and Pins” by Alex Gold.↩︎\n",
    "preview": {},
    "last_modified": "2022-08-03T14:04:43-04:00",
    "input_file": "posits-conf-time.knit.md"
  },
  {
    "path": "posts/2022-06-21-is-my-ai-discriminatory/",
    "title": "Is my AI Discriminatory?",
    "description": "A discussion about bias in healthcare AI, and building models with fairness and ethics in mind. [5 min read]",
    "author": [
      {
        "name": "Meggie Debnath",
        "url": {}
      }
    ],
    "date": "2022-06-21",
    "categories": [
      "post-journal-club",
      "bias-fairness-ethics"
    ],
    "contents": "\n\nContents\nBias is everywhere\nHealthcare data, like any data, is flawed\nBuilding fairer models\nTakeaways\nAdditional resources\n\nArtificial intelligence (AI) and machine learning (ML), in particular, are part of decision making across industries, the public sectors, and everywhere in between. From identifying fraudulent bank transactions to listing the shows and movies we’re most likely to enjoy, AI is deeply embedded within our everyday lives. Oftentimes the results or outputs of these decisions are relatively harmless. However, increasingly, machine learning models are trained on complex and sensitive data, and used as part of decision making processes for diagnosing diseases or making hiring decisions. While these models have the ability to transform and improve lives, sometimes the decisions made or informed by AI can have far-reaching consequences.\nAs a part of our team’s bi-weekly journal clubs, we talked about sources of bias for AI models, the potential consequences and harms they can create, and what we can do as data scientists within the healthcare space.\nBias is everywhere\nBias is a part of human nature, coming from the limited view of the world that any single person or group can achieve. Whether implicitly or explicitly, this bias gets captured within our institutions and by extension - the data that we record. It can be reflected and amplified by artificial intelligence models that are trained using this data. Generally, the bias encoded within AI tools result in the greatest harm toward disadvantaged groups and people, such as racial minorities.\n\n\n\nFigure 1: Different types of bias that can exist when training machine learning models source\n\n\n\nThere are a few different ways bias can affect the prediction or decision made by an algorithm (Norori et al. 2021):\nHuman bias: underlying bias within the data caused by societal inequities and biased human decision-making\nData-driven bias: when training data is not representative of the population in which the algorithm will be applied\nAlgorithmic bias: when model development or training methods result in biased outcomes\nBy the same token, harms as a result of biased AI can manifest in different ways:\nHarm of allocation: if people are denied opportunities or resources based on the decision of an AI. An example of this is Amazon’s resume screening tool that was biased against women because it was trained on data from the past 10 years, which was overwhelmingly male.\nHarm of quality-of-service: when an AI tool does not perform at the same level for one group as it does for another. An example of this may be voice assistants trained on predominantly male voices may have trouble recognizing the voices of women who use it.\nIn this way, AI can be a flawed reflection of our society and its systemic biases, and can become a “gatekeeper” for jobs, medical treatments, and opportunities.\nHealthcare data, like any data, is flawed\nWithin the context of healthcare services, it is especially important to consider the types of bias within our data, as decisions made with the support of AI have the ability to influence critical decisions such as which patients receive additional care, or what medication dosages are prescribed. As with many other industries, healthcare and medical data can be biased, incorrect, missing, and incomplete.\nEven without the presence of AI tools, healthcare data holds implicit bias. For example, when visiting the emergency department for abdominal pain, men wait an average of 49 minutes before receiving an analgesic, whereas women wait an average of 65 minutes (Chen et al. 2008). The COVID-19 pandemic has also highlighted many existing racial inequities in healthcare, with the morbidity and mortality rate being higher for Black Americans, Native Americans, Pacific Islanders, and Hispanic/Latino patients compared with White Americans (Gawthrop 2022).\nWhen machine learning models are trained using data that already contains historical and societal inequities, these patterns are learned by the model, and the biases can be amplified when making predictions for new patients. Models that are deployed with underlying biases can disadvantage the groups who were under or mis-represented within the training data. For example, algorithms trained to identify disease within chest radiograph images were found to have higher underdiagnosis rates for female patients, patients under 20 years old, Black patients, and Hispanic patients. In other words, the risk of being falsely predicted as “healthy” were higher for these groups of people, meaning their clinical treatment would have been delayed or missed entirely (Seyyed-Kalantari et al. 2021).\nBuilding fairer models\nWe know that our models can contain harmful biases. But what can we do as data scientists in the healthcare space to ensure our models benefit the most people, and don’t cause harm? This might be a daunting question, one that led to a lot more questions for our team:\nHow can we improve our development and monitoring processes to identify biases before they are deployed?\nShould we have a feedback loop to communicate data discrepancies and inform future data collection?\nHow can we better incorporate the patient experience and expertise?\nCan we incorporate recourse and contestability into our data science pipelines?\nBuilding fairer models is an iterative process, and one that requires more than one solution. Although not all are possible to implement everywhere, especially all at once, below are a few things our team is learning about and working on:\nUnderstanding sources and limitations of data. This involves thinking about where the data coming from and if there’s potential for any of the variables to be biased. For example, data containing a single variable “gender” with limited responses may actually be a mixture of sex or perceived gender, rather than reflecting a patient’s true gender identity.\nBuilding models with an interdisciplinary and diverse team. When developing any kind of AI tool for clinical deployment, we heavily collaborate with the clinician teams that are involved. In addition, our project teams consist of people with varied backgrounds, experiences, cultures, and training.\nEvaluating model performance across sub-groups and applying techniques for improving explainability. There are many tools and resources for evaluating model fairness and understanding how a model performs for subgroups. Tools such as InterpretML and modelStudio.\nCreating and following standards for data, processes, models, and reporting. Standardization of these elements of a data science project ensures that there are clear guidelines and expectations, consistency among and across projects, and benchmarks to evaluate quality.\nMonitoring data, model usage, and performance over time. Monitoring how our models are performing after deployment is important to ensure there hasn’t been any data drift or changes in the environment that may cause poor performance.\nLearning, discussing, and sharing. We believe it’s important to keep learning, discussing through things like journal clubs, and where possible, sharing our processes, code, research, and learnings.\nAI has countless potential benefits, especially within healthcare - to improve patient care, hospital efficiency, and support decision-making. Working to build fairer models will help improve trust among clinically deployed AI tools, and ensure that all groups of people can benefit from the decisions made and supported by AI.\nTakeaways\nHuman bias, data-driven bias, and algorithmic bias are common ways in which a model might perform poorly for some patient subgroups, causing denial of opportunities or reducing quality of service\nThere is no perfect data, but there are different ways to combat bias and build models that are useful and reduce harms\nSome techniques for building better and fairer models include understanding sources of bias, building models considering multiple perspectives, evaluating them for fairness and explainability, and monitoring after deployment\nAdditional resources\nBelow are the full list of topics and readings that we dove into for our journal club series on bias, fairness, and ethics in healthcare AI.\nTopic\nReading Materials\nIntroduction to Bias, Fairness, and Ethics in AI\nMedicine’s Machine Learning Problem\nIndigenous Data, Representing Race in AI, and Structural Racism in Healthcare\nStructural racism in precision medicine: leaving no one behind Racial Disparities and Mistrust in End-of-Life Care Dissecting racial bias in an algorithm used to manage the health of populations Racism and Health: Evidence and Needed Research The disturbing return of scientific racism\nMachine Learning Best Practices & Regulations\nFDA In Brief: FDA Collaborates with Health Canada and UK’s MHRA to Foster Good Machine Learning Practice Algorithmic Impact Assessment tool Suicide hotline shares data with for-profit spinoff, raising ethical questions Their Bionic Eyes are now Obsolete and Unsupported\nFailure modes and Equity Concerns in Medical Imaging Models\nReading Race: AI Recognizes Patient’s Racial Identity in Medical Images Under-diagnosis bias of artificial intelligence algorithms applied to chest radiographs in under-served patient populations Common pitfalls and recommendations for using machine learning to detect and prognosticate for COVID-19 using chest radiographs and CT scans\nBias and Assessing Model Fairness & Transparency\nMan is to Computer Programmer as Woman is to Homemaker? Debiasing Word Embeddings How to make sure your model is fair, accountable, and transparent AI FactSheets 360\nRepresenting Sex & Gender in AI and Healthcare Data\nTransgender-inclusive measures of sex/gender for population surveys: Mixed-methods evaluation and recommendations Sex and gender differences and biases in artificial intelligence for biomedicine and healthcare\n\n\n\nChen, Esther H., Frances S. Shofer, Anthony J. Dean, Judd E. Hollander, William G. Baxt, Jennifer L. Robey, Keara L. Sease, and Angela M. Mills. 2008. “Gender Disparity in Analgesic Treatment of Emergency Department Patients with Acute Abdominal Pain.” Academic Emergency Medicine 15 (5): 414–18. https://doi.org/10.1111/j.1553-2712.2008.00100.x.\n\n\nGawthrop, Elisabeth. 2022. “Color of Coronavirus: COVID-19 Deaths Analyzed by Race and Ethnicity.” APM Research Lab. https://www.apmresearchlab.org/covid/deaths-by-race.\n\n\nNorori, Natalia, Qiyang Hu, Florence Marcelle Aellen, Francesca Dalia Faraci, and Athina Tzovara. 2021. “Addressing Bias in Big Data and AI for Health Care: A Call for Open Science.” Patterns 2 (10): 100347. https://doi.org/10.1016/j.patter.2021.100347.\n\n\nSeyyed-Kalantari, Laleh, Haoran Zhang, Matthew B. A. McDermott, Irene Y. Chen, and Marzyeh Ghassemi. 2021. “Underdiagnosis Bias of Artificial Intelligence Algorithms Applied to Chest Radiographs in Under-Served Patient Populations.” Nature Medicine 27 (12): 2176–82. https://doi.org/10.1038/s41591-021-01595-0.\n\n\n\n\n",
    "preview": "posts/2022-06-21-is-my-ai-discriminatory/ai-biases.jpg",
    "last_modified": "2022-08-02T16:07:56-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-05-09-ooh-na-na-where-are-my-sodium-labs/",
    "title": "Ooh na na... where are my sodium labs?",
    "description": "The NA bug, or, what happens when the same word is used in different contexts. [5 min read]",
    "author": [
      {
        "name": "Chloe Pou-Prom",
        "url": {}
      }
    ],
    "date": "2022-05-09",
    "categories": [
      "language-R",
      "project-chartwatch",
      "post-miscellaneous"
    ],
    "contents": "\n\nContents\nSilent deployment\nMonitoring labs\nThe NA bug\nTakeaways\n\n\n\n\nSilent deployment\nOur team had been working actively on developing CHARTwatch, an early warning system for patients in general internal medicine at St. Michael’s Hospital. In November 2019 we were ready to move to a silent deployment phase, which means our entire pipeline was running (from data extraction to data processing to model prediction), but no outputs were going to the end-user.\nTypically, the goal of the silent deployment phase is to uncover unexpected behaviors with the data, system, or model. During model development and evaluation, we had only worked with historical extracts of the data. When moving from historical data to live data, there’s the risk of running into data issues (Cohen et al. 2021).\nThe data can be different due to external factors. For example, all of our models were trained on data prior to COVID-19, but shortly after the beginning of our silent deployment phase, we began to observe cases of COVID-19 in the hospital.\nThe data can be different due to data entry errors. For example, a body temperature could incorrectly be entered as 3700 °C instead of 37.00 °C.\nThe data can be different due to selection bias. For example, during training we excluded patients with really short and really long visits, as they were rare. However, we may encounter these kinds of visits in the live data.\nMonitoring labs\nWe had set up a monitoring dashboard to measure model inputs and model outputs. On close inspection, we made a discovery that was unquestionably odd… no sodium labs had been measured since we had moved to silent testing!\n\n\n\n{\"x\":{\"attrs\":{\"title\":\"Electrolyte counts\",\"labels\":[\"day\",\"CA\",\"CL\",\"GLPOC\",\"K\",\"NA.\"],\"retainDateWindow\":false,\"axes\":{\"x\":{\"pixelsPerLabel\":60,\"drawAxis\":true},\"y\":{\"drawAxis\":true}},\"stackedGraph\":true,\"fillGraph\":false,\"fillAlpha\":0.15,\"stepPlot\":false,\"drawPoints\":false,\"pointSize\":1,\"drawGapEdgePoints\":false,\"connectSeparatedPoints\":false,\"strokeWidth\":1,\"strokeBorderColor\":\"white\",\"colorValue\":0.5,\"colorSaturation\":1,\"includeZero\":false,\"drawAxesAtZero\":false,\"logscale\":false,\"axisTickSize\":3,\"axisLineColor\":\"black\",\"axisLineWidth\":0.3,\"axisLabelColor\":\"black\",\"axisLabelFontSize\":14,\"axisLabelWidth\":60,\"drawGrid\":true,\"gridLineWidth\":0.3,\"rightGap\":5,\"digitsAfterDecimal\":2,\"labelsKMB\":false,\"labelsKMG2\":false,\"labelsUTC\":false,\"maxNumberWidth\":6,\"animatedZooms\":false,\"mobileDisableYTouch\":true,\"disableZoom\":false,\"legend\":\"auto\",\"labelsDivWidth\":400,\"labelsShowZeroValues\":true,\"labelsSeparateLines\":false,\"hideOverlayOnMouseOut\":true},\"scale\":\"daily\",\"annotations\":[],\"shadings\":[],\"events\":[],\"format\":\"date\",\"data\":[[\"2019-11-19T00:00:00.000Z\",\"2019-11-20T00:00:00.000Z\",\"2019-11-21T00:00:00.000Z\",\"2019-11-22T00:00:00.000Z\",\"2019-11-23T00:00:00.000Z\",\"2019-11-24T00:00:00.000Z\",\"2019-11-25T00:00:00.000Z\",\"2019-11-26T00:00:00.000Z\",\"2019-11-27T00:00:00.000Z\",\"2019-11-28T00:00:00.000Z\",\"2019-11-29T00:00:00.000Z\",\"2019-11-30T00:00:00.000Z\",\"2019-12-01T00:00:00.000Z\",\"2019-12-02T00:00:00.000Z\",\"2019-12-03T00:00:00.000Z\",\"2019-12-04T00:00:00.000Z\",\"2019-12-05T00:00:00.000Z\",\"2019-12-06T00:00:00.000Z\",\"2019-12-07T00:00:00.000Z\",\"2019-12-08T00:00:00.000Z\",\"2019-12-09T00:00:00.000Z\",\"2019-12-10T00:00:00.000Z\",\"2019-12-11T00:00:00.000Z\",\"2019-12-12T00:00:00.000Z\",\"2019-12-13T00:00:00.000Z\",\"2019-12-14T00:00:00.000Z\",\"2019-12-15T00:00:00.000Z\",\"2019-12-16T00:00:00.000Z\",\"2019-12-17T00:00:00.000Z\",\"2019-12-18T00:00:00.000Z\",\"2019-12-19T00:00:00.000Z\"],[18,23,18,19,18,18,20,15,21,11,20,15,15,14,14,9,14,12,7,12,17,13,14,12,21,15,15,24,24,22,13],[51,53,70,64,58,51,62,62,58,57,61,53,60,72,57,62,58,44,38,40,60,48,47,43,65,52,52,56,51,61,66],[56,41,50,56,54,66,51,56,52,60,72,52,79,74,83,91,77,64,60,61,57,68,59,62,55,42,59,65,63,50,70],[51,52,70,63,58,52,62,61,59,57,60,51,60,72,55,62,57,43,37,40,60,47,47,42,64,51,52,54,53,61,65],[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]],\"fixedtz\":false,\"tzone\":\"UTC\"},\"evals\":[],\"jsHooks\":[]}\nFigure 1: Daily counts of lab measurements: this includes counts for calcium (CA), chloride (CL), glucose (GLPOC), potassium (K), and sodium (NA).\n\n\n\nDid this make sense? NA! Sodium is measured in routinely ordered blood tests. It’ll usually get ordered alongside other tests (such as calcium, chloride, glucose, and potassium) as part of a basic metabolic panel. In Figure 1, we look at the daily counts of labs on units in which CHARTwatch was silently deployed. The other labs were regularly measured, but our pipeline had not detected a single sodium lab. There was NA way sodium would be missing!\nThe NA bug\nAfter hours of detective work, we found the issue:\nIn R, the programming language we used to develop CHARTwatch, the symbol NA stands for “not available” and is used to represent missing data.\nIn chemistry, Na is the symbol used to represent the chemical element of sodium.\n\n\n\n{\"x\":{\"attrs\":{\"title\":\"Electrolyte counts\",\"labels\":[\"day\",\"CA\",\"CL\",\"GLPOC\",\"K\",\"NA.\"],\"retainDateWindow\":false,\"axes\":{\"x\":{\"pixelsPerLabel\":60,\"drawAxis\":true},\"y\":{\"drawAxis\":true}},\"stackedGraph\":true,\"fillGraph\":false,\"fillAlpha\":0.15,\"stepPlot\":false,\"drawPoints\":false,\"pointSize\":1,\"drawGapEdgePoints\":false,\"connectSeparatedPoints\":false,\"strokeWidth\":1,\"strokeBorderColor\":\"white\",\"colorValue\":0.5,\"colorSaturation\":1,\"includeZero\":false,\"drawAxesAtZero\":false,\"logscale\":false,\"axisTickSize\":3,\"axisLineColor\":\"black\",\"axisLineWidth\":0.3,\"axisLabelColor\":\"black\",\"axisLabelFontSize\":14,\"axisLabelWidth\":60,\"drawGrid\":true,\"gridLineWidth\":0.3,\"rightGap\":5,\"digitsAfterDecimal\":2,\"labelsKMB\":false,\"labelsKMG2\":false,\"labelsUTC\":false,\"maxNumberWidth\":6,\"animatedZooms\":false,\"mobileDisableYTouch\":true,\"disableZoom\":false,\"legend\":\"auto\",\"labelsDivWidth\":400,\"labelsShowZeroValues\":true,\"labelsSeparateLines\":false,\"hideOverlayOnMouseOut\":true},\"scale\":\"daily\",\"annotations\":[],\"shadings\":[],\"events\":[],\"format\":\"date\",\"data\":[[\"2019-11-19T00:00:00.000Z\",\"2019-11-20T00:00:00.000Z\",\"2019-11-21T00:00:00.000Z\",\"2019-11-22T00:00:00.000Z\",\"2019-11-23T00:00:00.000Z\",\"2019-11-24T00:00:00.000Z\",\"2019-11-25T00:00:00.000Z\",\"2019-11-26T00:00:00.000Z\",\"2019-11-27T00:00:00.000Z\",\"2019-11-28T00:00:00.000Z\",\"2019-11-29T00:00:00.000Z\",\"2019-11-30T00:00:00.000Z\",\"2019-12-01T00:00:00.000Z\",\"2019-12-02T00:00:00.000Z\",\"2019-12-03T00:00:00.000Z\",\"2019-12-04T00:00:00.000Z\",\"2019-12-05T00:00:00.000Z\",\"2019-12-06T00:00:00.000Z\",\"2019-12-07T00:00:00.000Z\",\"2019-12-08T00:00:00.000Z\",\"2019-12-09T00:00:00.000Z\",\"2019-12-10T00:00:00.000Z\",\"2019-12-11T00:00:00.000Z\",\"2019-12-12T00:00:00.000Z\",\"2019-12-13T00:00:00.000Z\",\"2019-12-14T00:00:00.000Z\",\"2019-12-15T00:00:00.000Z\",\"2019-12-16T00:00:00.000Z\",\"2019-12-17T00:00:00.000Z\",\"2019-12-18T00:00:00.000Z\",\"2019-12-19T00:00:00.000Z\",\"2019-12-20T00:00:00.000Z\",\"2019-12-21T00:00:00.000Z\",\"2019-12-22T00:00:00.000Z\",\"2019-12-23T00:00:00.000Z\",\"2019-12-24T00:00:00.000Z\",\"2019-12-25T00:00:00.000Z\",\"2019-12-26T00:00:00.000Z\",\"2019-12-27T00:00:00.000Z\",\"2019-12-28T00:00:00.000Z\",\"2019-12-29T00:00:00.000Z\",\"2019-12-30T00:00:00.000Z\",\"2019-12-31T00:00:00.000Z\",\"2020-01-01T00:00:00.000Z\",\"2020-01-02T00:00:00.000Z\",\"2020-01-03T00:00:00.000Z\",\"2020-01-04T00:00:00.000Z\",\"2020-01-05T00:00:00.000Z\",\"2020-01-06T00:00:00.000Z\",\"2020-01-07T00:00:00.000Z\",\"2020-01-08T00:00:00.000Z\",\"2020-01-09T00:00:00.000Z\",\"2020-01-10T00:00:00.000Z\",\"2020-01-11T00:00:00.000Z\",\"2020-01-12T00:00:00.000Z\",\"2020-01-13T00:00:00.000Z\",\"2020-01-14T00:00:00.000Z\",\"2020-01-15T00:00:00.000Z\",\"2020-01-16T00:00:00.000Z\",\"2020-01-17T00:00:00.000Z\",\"2020-01-18T00:00:00.000Z\",\"2020-01-19T00:00:00.000Z\",\"2020-01-20T00:00:00.000Z\"],[18,23,18,19,18,18,20,15,21,11,20,15,15,14,14,9,14,12,7,12,17,13,14,12,21,15,15,24,24,22,13,24,23,17,30,32,25,20,29,16,20,20,16,18,23,21,23,26,21,16,17,14,15,14,16,16,21,22,19,24,25,23,33],[51,53,70,64,58,51,62,62,58,57,61,53,60,72,57,62,58,44,38,40,60,48,47,43,65,52,52,56,51,61,66,72,66,62,87,77,60,81,79,70,67,61,53,53,82,76,74,85,76,91,85,75,74,73,63,72,65,80,65,68,62,54,74],[56,41,50,56,54,66,51,56,52,60,72,52,79,74,83,91,77,64,60,61,57,68,59,62,55,42,59,65,63,50,70,68,69,82,90,82,80,84,70,87,98,67,62,64,113,100,87,105,75,91,109,120,109,92,82,91,65,79,69,58,48,58,62],[51,52,70,63,58,52,62,61,59,57,60,51,60,72,55,62,57,43,37,40,60,47,47,42,64,51,52,54,53,61,65,72,66,62,86,77,60,81,79,70,66,61,53,53,79,75,74,86,76,90,84,75,74,72,63,72,64,80,66,67,62,55,73],[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,68,66,62,87,77,60,81,79,70,67,61,53,53,82,76,75,85,77,91,84,75,74,73,63,72,65,80,65,68,62,54,73]],\"fixedtz\":false,\"tzone\":\"UTC\"},\"evals\":[],\"jsHooks\":[]}\nFigure 2: Daily counts of lab measurements after fixing the NA bug\n\n\n\nDepending on the context, the symbol meant something different! Our data extraction pipeline was interpreting the chemical element Na as “not available!”\nThe fix was quite straightforward. We updated the parameters of one of our function calls to specify that \"\" (empty string) should be used to represent “not available,” instead of \"NA\". From the documentation of the RODBC package:\n\nna.strings: character string(s) to be mapped to NA when reading character data, default “NA”\n\nAfter deploying this fix, sodium counts were back to normal (as seen in Figure 2).\nWhile the fix was a simple one-line change, the problem we uncovered lead to plenty of follow-up questions!\nWere there other cases where the same symbol meant two different things based on the context?\nWhat does our electronic health record use to represent a missing value? Do they go with a number that’s biologically impossible? (e.g., a body temperature of -1000) Do they use a specific symbol/term? (e.g., “not measured,” “missing”)\nHow are these decisions made?\nRecently, there’s been a push for improvement in data quality standards, such as “Datasheets for Datasets” (Gebru et al. 2021) and the explosion of features stores, model stores, and evaluation stores1.\nTakeaways\nNA (sodium) ≠ NA (not available)\nSilent deployment is important.\nThorough metadata and data quality standards are important to mitigating these kinds of issues.\n\n\n\nCohen, Joseph Paul, Tianshi Cao, Joseph D. Viviano, Chin-Wei Huang, Michael Fralick, Marzyeh Ghassemi, Muhammad Mamdani, Russell Greiner, and Yoshua Bengio. 2021. “Problems in the Deployment of Machine-Learned Models in Health Care.” CMAJ 193 (35): E1391–94. https://doi.org/10.1503/cmaj.202066.\n\n\nGebru, Timnit, Jamie Morgenstern, Briana Vecchione, Jennifer Wortman Vaughan, Hanna Wallach, Hal Daumé III, and Kate Crawford. 2021. “Datasheets for Datasets.” Communications of the ACM 64 (12): 86–92. http://arxiv.org/abs/1803.09010.\n\n\nWhat kind of “store” do we think is next? 🤔↩︎\n",
    "preview": "posts/2022-05-09-ooh-na-na-where-are-my-sodium-labs/preview.PNG",
    "last_modified": "2022-07-14T13:14:13-04:00",
    "input_file": {}
  }
]
